# Урок 1. Задание 5.

# Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки). Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

proceeds = int(input('Введите значение выручки: '))
costs = int(input('Введите значение издержек: '))

if proceeds >= costs:
    profit = proceeds - costs
    print(f'Ваша прибыль составляет: {profit}\n'
          f'Рентабельность выручки: {"{:.2%}".format(profit / proceeds)}')
    num_employees = int(input('Введите количество работников: '))
    print(f'Прибыль в расчете на одного сотрудника составляет: {profit/num_employees}')
else:
    print(f'Ваши убытки составляют: {costs - proceeds}')


