# Урок 1. Задание 1.

# Создать несколько переменных, вывести их на экран.
var_string = 'Строка'
var_integer = 123
var_float = 12.34
var_bool = True

print(f'*Значения переменных с разными типами*\n\
Строковый тип данных: {var_string}\n\
Целые числа: {var_integer}\n\
Вещественные числа: {var_float}\n\
Булево значение: {var_bool}\n')

# Запросить у пользователя несколько чисел и строк и сохранить в переменные, вывести на экран.
age = int(input('Введите количество полных лет: '))
year = int(input('Введите год рождения: '))
first_name = input('Введите Ваше имя: ')
last_name = input('Введите Вашу фамилию: ')

print(f'\n*Ваши данные*\nИмя: {first_name}\nФамилия: {last_name}\nГод рождения: {year}\nПолных лет: {age}')
