# Урок 1. Задание 4.

# Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

number = int(input('Введите целое положительное число: '))

# Если число состоит из одной цифры, то в цикл не заходим
if number < 10:
    max_number = number

else:
    # Последняя цифра - максимальное значение
    max_number = number % 10
    while number > 0:
        # Находим следующую цифру
        next_num = (number // 10) % 10
        # Сравниваем максимум со следующей цифрой, если она больше, то становится максимумом
        if max_number < next_num:
            max_number = next_num
        # Отбрасываем последнюю цифру из числа
        number //= 10

print(f'Самая большая цифра в числе: {max_number}')
