# Урок 1. Задание 6.

# Спортсмен занимается ежедневными пробежками.
# В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который результат спортсмена составит не менее b километров.
# Программа должна принимать значения параметров a и b и  выводить одно натуральное число — номер дня.

# Пробег в первый день и целевой километраж
distance_per_day = int(input('Укажите преодоленное расстояние в первый день (км): '))
target = int(input('Введите вашу цель (км): '))

count_day = 1
while True:
    if distance_per_day >= target:
        print(f'{count_day}-й день: {distance_per_day}')
        # print(f'На {count_day}-й день спортсмен достиг результата — не менее {target} км.')
        break

    print(f'{count_day}-й день: {distance_per_day}')
    # +10% каждый день и округляем до сотых
    distance_per_day = round(distance_per_day * 1.1, 2)
    count_day += 1
