# Урок 2. Задание 1.

# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

# Создаем список и заполняем его элементами различных типов данных
# явно, без запроса у пользователя

list_another_type = [1,
                     1.5,
                     complex(1, 2),
                     'text',
                     True,
                     ['list'],
                     ('turple',),
                     {'dict_key': 'dict_value'},
                     {1, 2, 3},
                     None,
                     b'some']

# Проверяем тип данных списка
for i in list_another_type:
    print(i, type(i))
