# Задача 5. Урок 2.
#
# Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].


list_rating = [7, 5, 3, 3, 2]
print(f'Текущий рейтинг: {list_rating}')
list_rating.append(int(input('Введите новое значение рейтинга: ')))

# Сортируем список по убыванию
list_rating.sort(reverse=True)
print(f'Новый рейтинг {list_rating}')
