# Задача 4. Урок 2
#
# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки.
# Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

user_list = input('Введите строку из нескольки слов, разделенных пробелами: ').split()
for num, i in enumerate(user_list, 1):
    print(num, i[:10])
