# Задание 2. Урок 2.
#
# Для списка реализовать обмен значений соседних элементов,
# т.е. Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

# Создаем начальный список
# Длинну списка и элементы списка задает пользователь
list_length = int(input('Введите количесво элементов списка: '))
start_list = [input('Введите элемент списка: ') for i in range(list_length)]
print(f'Стартовый список: {start_list}')

# Меняем значения местами
for i in range(0, list_length-1, 2):
    start_list[i], start_list[i+1] = start_list[i+1], start_list[i]
print(f'Итоговый список: {start_list}')
