# Задание 4. Урок 3.
#
# Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
#
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

# возведение в степень с помощью оператора **
def exp_plain(real_number, negative_degree):
    return real_number ** negative_degree


# реализация без оператора **
def exp_hard(real_number, negative_degree):
    prod = 1
    for i in range(abs(negative_degree)):
        prod *= real_number
    return 1 / prod


# Пример работы функций
print(exp_plain(6, -2))
print(exp_hard(6, -2))
