# Задание 3. Урок.3
#
# Реализовать функцию my_func(),
# которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.

def my_func(arg_1, arg_2, arg_3):
    # делаем список параметров
    args_list = [arg_1, arg_2, arg_3]
    # удаляем минимальное значение из списка
    args_list.remove(min(args_list))
    # возвращаем сумму
    return sum(args_list)


print(f'Cумма максимальных значений: {my_func(2, 2, 2)}')
