# Задание 1. Урок 6.
#
# Создать класс TrafficLight(светофор).
# определить у него один атрибут color(цвет) и метод running(запуск);
# атрибут реализовать как приватный;
# в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
# продолжительность (красный) составляет 7 секунд, второго(жёлтый) — 2, третьего(зелёный) — на ваше усмотрение;
# переключение между режимами должно осуществляться только в указанном порядке(красный, жёлтый, зелёный);
# проверить работу примера, создав экземпляр и вызвав описанный метод.
#
# Задачу можно усложнить, реализовав проверку порядка режимов.
# При его нарушении выводить соответствующее сообщение и завершать скрипт.

import itertools
import time


class TrafficLight:
    def __init__(self):
        self.__color = None

    def running(self):
        traffic_light = {'RED': 7, 'YELLOW': 2, 'GREEN': 4}
        for color, timer in itertools.cycle(traffic_light.items()):
            self.__color = color
            print(self.__color)
            time.sleep(timer)


my_tl = TrafficLight()
my_tl.running()
